


MATCH (T)-[t]->(P: Patients {Name:"P88"})<-[ct]-(I)
WHERE I.Name in P.Ill and P.Name in T.Pat
RETURN P.Doc AS DOCTOR, P.Ill AS ILLNESS, collect(DISTINCT T.Name) AS TREATMENT;


######################
# Here is the result #
######################

+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| DOCTOR               | ILLNESS                 | TREATMENT                                                                                                                  |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| ["D81", "D5", "D52"] | ["I35", "I332", "I914"] | ["T318", "T120", "T315", "T127", "T640", "T662", "T644", "T481", "T666", "T736", "T32", "T681", "T13", "T3", "T39", "T85"] |
+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

1 row available after 41 ms, consumed after another 0 ms
